sandbox/redis-bench/localhost.txt
====== PING_INLINE ======
  10000 requests completed in 0.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.12% <= 1 milliseconds
99.94% <= 2 milliseconds
99.98% <= 3 milliseconds
100.00% <= 3 milliseconds
60606.06 requests per second

====== PING_BULK ======
  10000 requests completed in 0.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
69930.07 requests per second

====== SET ======
  10000 requests completed in 0.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
72992.70 requests per second

====== GET ======
  10000 requests completed in 0.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
63694.27 requests per second

====== INCR ======
  10000 requests completed in 0.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.81% <= 1 milliseconds
100.00% <= 1 milliseconds
69444.45 requests per second

====== LPUSH ======
  10000 requests completed in 0.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
90090.09 requests per second

====== LPOP ======
  10000 requests completed in 0.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
78125.00 requests per second

====== SADD ======
  10000 requests completed in 0.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.51% <= 1 milliseconds
100.00% <= 1 milliseconds
72463.77 requests per second

====== SPOP ======
  10000 requests completed in 0.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
76923.08 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  10000 requests completed in 0.15 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
66225.17 requests per second

====== LRANGE_100 (first 100 elements) ======
  10000 requests completed in 0.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

49.48% <= 1 milliseconds
97.89% <= 2 milliseconds
100.00% <= 2 milliseconds
21413.28 requests per second

====== LRANGE_300 (first 300 elements) ======
  10000 requests completed in 0.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
16.73% <= 2 milliseconds
93.50% <= 3 milliseconds
97.53% <= 4 milliseconds
99.27% <= 5 milliseconds
99.67% <= 6 milliseconds
99.85% <= 7 milliseconds
100.00% <= 7 milliseconds
10319.92 requests per second

====== LRANGE_500 (first 450 elements) ======
  10000 requests completed in 1.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.12% <= 1 milliseconds
2.61% <= 2 milliseconds
27.59% <= 3 milliseconds
74.73% <= 4 milliseconds
93.14% <= 5 milliseconds
96.84% <= 6 milliseconds
98.76% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
6954.10 requests per second

====== LRANGE_600 (first 600 elements) ======
  10000 requests completed in 1.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
0.22% <= 2 milliseconds
1.60% <= 3 milliseconds
19.21% <= 4 milliseconds
66.54% <= 5 milliseconds
89.89% <= 6 milliseconds
93.48% <= 7 milliseconds
95.95% <= 8 milliseconds
98.10% <= 9 milliseconds
99.05% <= 10 milliseconds
99.69% <= 11 milliseconds
99.73% <= 12 milliseconds
99.77% <= 13 milliseconds
99.88% <= 14 milliseconds
100.00% <= 14 milliseconds
5076.14 requests per second

====== MSET (10 keys) ======
  10000 requests completed in 0.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

34.55% <= 1 milliseconds
94.02% <= 2 milliseconds
99.08% <= 3 milliseconds
99.68% <= 4 milliseconds
100.00% <= 4 milliseconds
34246.57 requests per second